Repository: CrazyNeil/OllamaSpring
Catalog: *.lproj/Localizable.strings
Languages: ar, de, es, fr, ja, ko, zh_hans

# groq.description
source: Groq is a fast AI inference, powered by LPU™ AI inference technology which delivers fast, affordable, and energy efficient AI.
ar: Groq هو استدلال ذكاء اصطناعي سريع، مدعوم بتقنية الاستدلال LPU™ التي توفر ذكاء اصطناعي سريع وميسور التكلفة وفعال من حيث الطاقة.
de: Groq ist eine schnelle KI-Inferenz, angetrieben von LPU™ AI-Inferenztechnologie, die schnelle, erschwingliche und energieeffiziente KI liefert.
es: Groq es una inferencia de IA rápida, impulsada por la tecnología de inferencia de IA LPU™ que proporciona IA rápida, asequible y energéticamente eficiente.
fr: Groq est une inférence IA rapide, alimentée par la technologie d'inférence IA LPU™ qui fournit une IA rapide, abordable et économe en énergie.
ja: Groqは、LPU™ AI推論技術を搭載した高速AI推論で、高速、手頃、かつエネルギー効率の良いAIを提供します。
ko: Groq는 LPU™ AI 추론 기술로 구동되는 빠른 AI 추론으로, 빠르고 저렴하며 에너지 효율적인 AI를 제공합니다.
zh_hans: Groq 是一个快速的 AI 推理平台，由 LPU™ AI 推理技术驱动，提供快速、经济且节能的 AI 服务。

# ollama.host_config_title
source: Ollama HTTP Host Configuration
ar: تكوين خادم HTTP Ollama
de: Ollama HTTP-Host-Konfiguration
es: Configuración del host HTTP de Ollama
fr: Configuration de l'hôte HTTP Ollama
ja: Ollama HTTPホスト設定
ko: Ollama HTTP 호스트 구성
zh_hans: Ollama HTTP 主机配置

# ollama.connection_failed
source: Connection Failed
ar: فشل الاتصال
de: Verbindung fehlgeschlagen
es: Error de conexión
fr: Échec de la connexion
ja: 接続に失敗しました
ko: 연결 실패
zh_hans: 连接失败

# ollama.connection_failed_desc
source: Failed to connect to Ollama host. Please check your configuration and try again.
ar: فشل الاتصال بخادم Ollama. يرجى التحقق من التكوين والمحاولة مرة أخرى.
de: Verbindung zum Ollama-Host fehlgeschlagen. Bitte überprüfen Sie Ihre Konfiguration und versuchen Sie es erneut.
es: No se pudo conectar al host de Ollama. Por favor verifica tu configuración e inténtalo de nuevo.
fr: Impossible de se connecter à l'hôte Ollama. Veuillez vérifier votre configuration et réessayer.
ja: Ollamaホストへの接続に失敗しました。設定を確認して再試行してください。
ko: Ollama 호스트에 연결할 수 없습니다. 구성을 확인하고 다시 시도하세요.
zh_hans: 无法连接到 Ollama 主机。请检查您的配置并重试。

# ollama.ok
source: OK
ar: موافق
ko: 확인
zh_hans: 确定

# ollama.description
source: Configure the Ollama HTTP host and port. By default, the host is set to 127.0.0.1 and the port to 11434 in your local environment. You may only connect to remote hosts that do not require authentication.
ar: قم بتكوين خادم ومنفذ HTTP Ollama. افتراضياً، يتم تعيين الخادم على 127.0.0.1 والمنفذ على 11434 في بيئتك المحلية. يمكنك الاتصال فقط بالخوادم البعيدة التي لا تتطلب مصادقة.
de: Konfigurieren Sie den Ollama HTTP-Host und Port. Standardmäßig ist der Host auf 127.0.0.1 und der Port auf 11434 in Ihrer lokalen Umgebung eingestellt. Sie können nur eine Verbindung zu Remote-Hosts herstellen, die keine Authentifizierung erfordern.
es: Configura el host y puerto HTTP de Ollama. Por defecto, el host está configurado en 127.0.0.1 y el puerto en 11434 en tu entorno local. Solo puedes conectarte a hosts remotos que no requieran autenticación.
fr: Configurez l'hôte et le port HTTP Ollama. Par défaut, l'hôte est défini sur 127.0.0.1 et le port sur 11434 dans votre environnement local. Vous ne pouvez vous connecter qu'aux hôtes distants qui ne nécessitent pas d'authentification.
ja: Ollama HTTPホストとポートを設定します。デフォルトでは、ローカル環境でホストは127.0.0.1、ポートは11434に設定されています。認証を必要としないリモートホストにのみ接続できます。
ko: Ollama HTTP 호스트와 포트를 구성합니다. 기본적으로 로컬 환경에서 호스트는 127.0.0.1, 포트는 11434로 설정됩니다. 인증이 필요하지 않은 원격 호스트에만 연결할 수 있습니다.
zh_hans: 配置 Ollama HTTP 主机和端口。在本地环境中，主机默认设置为 127.0.0.1，端口设置为 11434。您只能连接到不需要身份验证的远程主机。

# ollamacloud.api_title
source: Ollama Cloud API
zh_hans: Ollama Cloud API 配置

# ollamacloud.enter_secret_key
source: ENTER SECRET KEY
de: GEHEIMSCHLÜSSEL EINGEBEN
es: INGRESAR CLAVE SECRETA
fr: ENTRER LA CLÉ SECRÈTE
ja: シークレットキーを入力
ko: 시크릿 키 입력
zh_hans: 输入密钥

# ollamacloud.how_to_apply
source: How to apply a Ollama Cloud API key?
de: Wie beantrage ich einen Ollama Cloud API-Schlüssel?
es: ¿Cómo solicitar una clave API de Ollama Cloud?
fr: Comment demander une clé API Ollama Cloud ?
ja: Ollama Cloud APIキーの申請方法は？
ko: Ollama Cloud API 키를 어떻게 신청하나요?
zh_hans: 如何申请 Ollama Cloud API 密钥？

# ollamacloud.click_here
source: click here
de: hier klicken
es: haz clic aquí
fr: cliquez ici
ja: ここをクリック
ko: 여기를 클릭
zh_hans: 点击这里

# ollamacloud.connection_failed
source: Connection Failed
de: Verbindung fehlgeschlagen
es: Error de conexión
fr: Échec de la connexion
ja: 接続に失敗しました
ko: 연결 실패
zh_hans: 连接失败

# ollamacloud.connection_failed_desc
source: Failed to connect to Ollama Cloud. Please verify your apiKey or HTTP Proxy Config.
de: Verbindung zu Ollama Cloud fehlgeschlagen. Bitte überprüfen Sie Ihren API-Schlüssel oder die HTTP-Proxy-Konfiguration.
es: No se pudo conectar a Ollama Cloud. Por favor verifica tu clave API o la configuración del proxy HTTP.
fr: Impossible de se connecter à Ollama Cloud. Veuillez vérifier votre clé API ou la configuration du proxy HTTP.
ja: Ollama Cloudへの接続に失敗しました。APIキーまたはHTTPプロキシ設定を確認してください。
ko: Ollama Cloud에 연결할 수 없습니다. API 키 또는 HTTP 프록시 구성을 확인하세요.
zh_hans: 无法连接到 Ollama Cloud 服务器。请验证您的 API 密钥或 HTTP 代理配置。

# ollamacloud.ok
source: OK
ko: 확인
zh_hans: 确定

# ollamacloud.description
source: Ollama Cloud provides managed hosting for Ollama models, offering scalable and reliable AI inference services in the cloud.
de: Ollama Cloud bietet verwaltetes Hosting für Ollama-Modelle und bietet skalierbare und zuverlässige KI-Inferenzdienste in der Cloud.
es: Ollama Cloud proporciona alojamiento gestionado para modelos Ollama, ofreciendo servicios de inferencia de IA escalables y confiables en la nube.
fr: Ollama Cloud fournit un hébergement géré pour les modèles Ollama, offrant des services d'inférence IA évolutifs et fiables dans le cloud.
ja: Ollama CloudはOllamaモデルの管理ホスティングを提供し、クラウドでスケーラブルで信頼性の高いAI推論サービスを提供します。
ko: Ollama Cloud는 Ollama 모델을 위한 관리형 호스팅을 제공하며, 클라우드에서 확장 가능하고 안정적인 AI 추론 서비스를 제공합니다.
zh_hans: Ollama Cloud 为 Ollama 模型提供托管服务，在云端提供可扩展且可靠的 AI 推理服务。

# ollama.library.install_title
source: Download & Install Ollama Local Model
ar: تثبيت نموذج Ollama
de: Ollama-Lokales Modell herunterladen & installieren
es: Descargar & Instalar modelo local de Ollama
fr: Installer le modèle Ollama
ja: Ollamaローカルモデルをダウンロード & インストール
ko: Ollama 로컬 모델 다운로드 & 설치
zh_hans: 下载安装 Ollama 本地模型

# ollama.library.enter_model_name
source: Enter Model Name
ar: أدخل اسم النموذج
de: Modellname eingeben
es: Ingresar nombre del modelo
fr: Entrer le nom du modèle
ja: モデル名を入力
ko: 모델 이름 입력
zh_hans: 输入模型名称

# ollama.library.what_is_model_name
source: what is model name? like llama3:70b
ar: ما هو اسم النموذج؟ مثل llama3:70b
de: Was ist der Modellname? wie llama3:70b
es: ¿qué es el nombre del modelo? como llama3:70b
fr: qu'est-ce que le nom du modèle ? comme llama3:70b
ja: モデル名とは？例：llama3:70b
ko: 모델 이름이란? 예: llama3:70b
zh_hans: 什么是模型名称？例如 llama3:70b

# ollama.library.click_here
source: click here
ar: انقر هنا
de: hier klicken
es: haz clic aquí
fr: cliquez ici
ja: ここをクリック
ko: 여기를 클릭
zh_hans: 点击这里

# ollama.library.warning
source: WARNING! Not all ollama library models support chat conversations. Just like CodeGemma works as a fill-in-the-middle model for code completion.
ar: تحذير! لا تدعم جميع نماذج مكتبة ollama محادثات الدردشة. تماماً مثل CodeGemma يعمل كنموذج fill-in-the-middle لإكمال الكود.
de: WARNUNG! Nicht alle Ollama-Bibliotheksmodelle unterstützen Chat-Gespräche. Genau wie CodeGemma als Fill-in-the-Middle-Modell für Code-Vervollständigung funktioniert.
es: ¡ADVERTENCIA! No todos los modelos de la biblioteca ollama admiten conversaciones de chat. Al igual que CodeGemma funciona como un modelo fill-in-the-middle para la completación de código.
fr: ATTENTION ! Tous les modèles de la bibliothèque ollama ne prennent pas en charge les conversations de chat. Tout comme CodeGemma fonctionne comme un modèle fill-in-the-middle pour la complétion de code.
ja: 警告！すべてのollamaライブラリモデルがチャット会話をサポートしているわけではありません。CodeGemmaがコード補完のためのfill-in-the-middleモデルとして機能するのと同様です。
ko: 경고! 모든 ollama 라이브러리 모델이 채팅 대화를 지원하지는 않습니다. CodeGemma가 코드 완성을 위한 fill-in-the-middle 모델로 작동하는 것과 같습니다.
zh_hans: 警告！并非所有 Ollama 库模型都支持聊天对话。就像 CodeGemma 作为代码补全的填充中间模型一样。

# menu.check_for_updates
source: Check for Updates…
ar: البحث عن التحديثات…
de: Nach Updates suchen…
es: Buscar actualizaciones…
fr: Vérifier les mises à jour…
ja: アップデートを確認…
ko: 업데이트 확인…
zh_hans: 检查更新…

# righttopbar.library
source: Download
ar: السوق
es: Descargar
fr: Marché
ja: ダウンロード
ko: 다운로드
zh_hans: 下载

# righttopbar.response_language
source: Response Language
ar: لغة الاستجابة
de: Antwortsprache
es: Idioma de respuesta
fr: Langue de réponse
ja: 応答言語
ko: 응답 언어
zh_hans: 响应语言

# righttopbar.api_host
source: API Host
ar: مضيف API
es: Host API
fr: Hôte API
ja: APIホスト
ko: API 호스트
zh_hans: API 主机

# righttopbar.streaming
source: Streaming
ar: التدفق
ja: ストリーミング
ko: 스트리밍
zh_hans: 流式输出

# righttopbar.no_models_found
source: No models found
ar: لم يتم العثور على نماذج
de: Keine Modelle gefunden
es: No se encontraron modelos
fr: Aucun modèle trouvé
ja: モデルが見つかりません
ko: 모델을 찾을 수 없습니다
zh_hans: 未找到模型

# righttopbar.unknown_model
source: Unknown Model
ar: نموذج غير معروف
de: Unbekanntes Modell
es: Modelo desconocido
fr: Modèle inconnu
ja: 不明なモデル
ko: 알 수 없는 모델
zh_hans: 未知模型

# righttopbar.groq_api_key_config
source: Groq API Key Config
ar: تكوين مفتاح API Groq
de: Groq API-Schlüssel-Konfiguration
es: Configuración de clave API de Groq
fr: Configuration de la clé API Groq
ja: Groq APIキー設定
ko: Groq API 키 구성
zh_hans: Groq API 密钥配置

# righttopbar.ollama_http_host_config
source: Ollama HTTP Host Config
ar: تكوين خادم HTTP Ollama
de: Ollama HTTP-Host-Konfiguration
es: Configuración del host HTTP de Ollama
fr: Configuration de l'hôte HTTP Ollama
ja: Ollama HTTPホスト設定
ko: Ollama HTTP 호스트 구성
zh_hans: Ollama HTTP 主机配置

# righttopbar.deepseek_api_key_config
source: DeepSeek API Key Config
ar: تكوين مفتاح API DeepSeek
de: DeepSeek API-Schlüssel-Konfiguration
es: Configuración de clave API de DeepSeek
fr: Configuration de la clé API DeepSeek
ja: DeepSeek APIキー設定
ko: DeepSeek API 키 구성
zh_hans: DeepSeek API 密钥配置

# righttopbar.ollamacloud_api_key_config
source: Ollama Cloud API Key Config
de: Ollama Cloud API-Schlüssel-Konfiguration
es: Configuración de clave API de Ollama Cloud
fr: Configuration de la clé API Ollama Cloud
ja: Ollama Cloud APIキー設定
ko: Ollama Cloud API 키 구성
zh_hans: Ollama Cloud API 密钥配置

# righttopbar.notice
source: Notice
ar: إشعار
de: Hinweis
es: Aviso
fr: Avis
ja: 通知
ko: 알림
zh_hans: 提示

# righttopbar.groq_no_streaming
source: Groq not support Streaming Output
ar: Groq لا يدعم الإخراج المتدفق
de: Groq unterstützt kein Streaming-Output
es: Groq no admite salida en streaming
fr: Groq ne prend pas en charge la sortie en streaming
ja: Groqはストリーミング出力をサポートしていません
ko: Groq는 스트리밍 출력을 지원하지 않습니다
zh_hans: Groq 不支持流式输出

# righttopbar.confirm
source: Confirm
ar: تأكيد
de: Bestätigen
es: Confirmar
fr: Confirmer
ja: 確認
ko: 확인
zh_hans: 确认

# statusbar.option_1
source: Option 1
ar: الخيار 1
es: Opción 1
ja: オプション1
ko: 옵션 1
zh_hans: 选项 1

# statusbar.option_2
source: Option 2
ar: الخيار 2
es: Opción 2
ja: オプション2
ko: 옵션 2
zh_hans: 选项 2

# statusbar.quit
source: Quit
ar: خروج
de: Beenden
es: Salir
fr: Quitter
ja: 終了
ko: 종료
zh_hans: 退出

# quick.prompt
source: Prompt
ar: الـ prompt
ja: プロンプト
ko: 프롬프트
zh_hans: 请输入

# quick.shortcut_hint
source: You can use the shortcut cmd + shift + h to open or hide the quick completion dialog
ar: يمكنك فتح الإكمال السريع باستخدام الاختصار cmd + shift + h
de: Sie können die Tastenkombination cmd + shift + h verwenden, um den Schnellabschluss-Dialog zu öffnen oder zu verbergen
es: Puedes usar el atajo cmd + shift + h para abrir u ocultar el cuadro de diálogo de completación rápida
fr: Vous pouvez utiliser le raccourci cmd + shift + h pour ouvrir ou masquer la boîte de dialogue de complétion rapide
ja: ショートカット cmd + shift + h を使用して、クイック補完ダイアログを開いたり非表示にしたりできます
ko: 단축키 cmd + shift + h를 사용하여 빠른 완성 대화 상자를 열거나 숨길 수 있습니다
zh_hans: 您可以使用快捷键 cmd + shift + h 开启或隐藏便捷对话框

# quick.ollama_not_available
source: You should start Ollama or install it first.
ar: يجب عليك بدء Ollama أو تثبيته أولاً.
de: Sie sollten zuerst Ollama starten oder installieren.
es: Debes iniciar Ollama o instalarlo primero.
fr: Vous devez d'abord démarrer Ollama ou l'installer.
ja: まずOllamaを開始またはインストールする必要があります。
ko: 먼저 Ollama를 시작하거나 설치해야 합니다.
zh_hans: 您需要先启动 Ollama 或安装它。

# quick.no_model
source: No model found. You may need to download a model and restart OllamaSpring first.
ar: لم يتم العثور على نموذج. قد تحتاج إلى تحميل نموذج وإعادة تشغيل OllamaSpring أولاً.
de: Kein Modell gefunden. Sie müssen möglicherweise zuerst ein Modell herunterladen und OllamaSpring neu starten.
es: No se encontró ningún modelo. Es posible que necesites descargar un modelo y reiniciar OllamaSpring primero.
fr: Aucun modèle trouvé. Vous devrez peut-être d'abord télécharger un modèle et redémarrer OllamaSpring.
ja: モデルが見つかりません。まずモデルをダウンロードしてOllamaSpringを再起動する必要があるかもしれません。
ko: 모델을 찾을 수 없습니다. 먼저 모델을 다운로드하고 OllamaSpring을 재시작해야 할 수도 있습니다.
zh_hans: 未找到模型。您可能需要下载一个模型并重启 OllamaSpring。

# quick.empty_input
source: Just tell me what is your question.
ar: أخبرني فقط ما هو سؤالك.
de: Sagen Sie mir einfach, was Ihre Frage ist.
es: Solo dime cuál es tu pregunta.
fr: Dites-moi simplement quelle est votre question.
ja: 質問内容を教えてください。
ko: 질문이 무엇인지 말씀해 주세요.
zh_hans: 请告诉我您的问题。

# quick.waiting
source: waiting ...
ar: في الانتظار...
de: Warten...
es: Esperando...
fr: En attente...
ja: 待機中...
ko: 대기 중...
zh_hans: 等待中...

# quick.text
source: Text
ar: نص
es: Texto
fr: Texte
ja: テキスト
ko: 텍스트
zh_hans: 文本

# quick.copied
source: COPIED
ar: تم النسخ
de: KOPIERT
es: COPIADO
fr: COPIÉ
ja: コピーしました
ko: 복사됨
zh_hans: 已复制

# messages.copied
source: COPIED
ar: تم النسخ
de: KOPIERT
es: COPIADO
fr: COPIÉ
ja: コピーしました
ko: 복사됨
zh_hans: 已复制

# messages.code_block_text
source: Text
ar: نص
es: Texto
fr: Texte
ja: テキスト
ko: 텍스트
zh_hans: 文本

# messages.share_preview
source: Share OllamaSpring Message
ar: مشاركة رسالة OllamaSpring
de: OllamaSpring-Nachricht teilen
es: Compartir mensaje de OllamaSpring
fr: Partager le message OllamaSpring
ja: OllamaSpringメッセージを共有
ko: OllamaSpring 메시지 공유
zh_hans: 分享 OllamaSpring 消息

# chatlist.new_conversation
source: New Conversation
de: Neues Gespräch
es: Nueva conversación
fr: Nouvelle conversation
ja: 新しい会話
ko: 새 대화
zh_hans: 新建对话

# chatlist.clear_all_conversations
source: Clear All Conversations
de: Alle Gespräche löschen
es: Borrar todas las conversaciones
fr: Effacer toutes les conversations
ja: すべての会話をクリア
ko: 모든 대화 지우기
zh_hans: 清空全部对话

# chatlist.clear_all_warning
source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
ja: 警告
ko: 경고
zh_hans: 警告

# chatlist.clear_all_message
source: This will delete all conversations and their messages. This action cannot be undone.
de: Dies löscht alle Gespräche und deren Nachrichten. Diese Aktion kann nicht rückgängig gemacht werden.
es: Esto eliminará todas las conversaciones y sus mensajes. Esta acción no se puede deshacer.
fr: Cela supprimera toutes les conversations et leurs messages. Cette action ne peut pas être annulée.
ja: これによりすべての会話とメッセージが削除されます。この操作は元に戻せません。
ko: 모든 대화와 메시지가 삭제됩니다. 이 작업은 취소할 수 없습니다.
zh_hans: 这将删除所有对话及其消息。此操作无法撤销。

# chatlist.clear_all_confirm
source: Clear All
de: Alle löschen
es: Borrar todo
fr: Tout effacer
ja: すべてクリア
ko: 모두 지우기
zh_hans: 清空全部

# ollama.library.error_empty_name
source: Model name cannot be empty
zh_hans: 模型名称不能为空

# ollama.library.error_invalid_name
source: Invalid model name format. Use only letters, numbers, hyphens, underscores, and colons.
zh_hans: 无效的模型名称格式。只允许使用字母、数字、连字符、下划线和冒号。

# ollama.library.error_already_installed
source: This model is already installed
zh_hans: 此模型已安装

# ollama.library.error_download_in_progress
source: Another download is in progress. Please wait.
zh_hans: 另一个下载正在进行中。请稍候。

# ollama.library.error_service_unavailable
source: Ollama service is not available. Please check if Ollama is running.
zh_hans: Ollama服务不可用。请检查Ollama是否正在运行。

# deepseek.api_title
source: DeepSeek API
ar: API DeepSeek
es: API DeepSeek
fr: API DeepSeek

# chatlist.top_k
source: Top K
ar: أعلى K

# chatlist.top_p
source: Top P
ar: أعلى P
