Repository: CrazyNeil/OllamaSpring
Catalog: *.lproj/Localizable.strings
Languages: ar, de, es, fr, ja, ko, zh_hans

source: Welcome to OllamaSpring
ar: مرحباً بك في OllamaSpring
de: Willkommen bei OllamaSpring
es: Bienvenido a OllamaSpring
fr: Bienvenue dans OllamaSpring
ja: OllamaSpringへようこそ
ko: OllamaSpring에 오신 것을 환영합니다
zh_hans: 欢迎使用 OllamaSpring

# welcome.help_today
source: How can I help you today?
ar: كيف يمكنني مساعدتك اليوم؟
de: Wie kann ich Ihnen heute helfen?
es: ¿Cómo puedo ayudarte hoy?
fr: Comment puis-je vous aider aujourd'hui ?
ja: 今日は何かお手伝いできることはありますか？
ko: 오늘 무엇을 도와드릴까요?
zh_hans: 今天我能帮您什么？

# welcome.no_model_message
source: Oops, you need to download a Ollama model first. You can find a 'Downloads' button at the bottom left. Enjoy!
ar: عذراً، تحتاج أولاً إلى تحميل نموذج Ollama. يمكنك العثور على زر التحميل في أسفل اليسار. استمتع!
de: Entschuldigung, Sie müssen zuerst ein Ollama-Modell herunterladen. Sie finden einen Download-Button unten links. Viel Spaß!
es: Lo siento, primero necesitas descargar un modelo de Ollama. Puedes encontrar un botón de descarga en la esquina inferior izquierda. ¡Disfruta!
fr: Désolé, vous devez d'abord télécharger un modèle Ollama. Vous pouvez trouver un bouton de téléchargement en bas à gauche. Amusez-vous bien !
ja: 申し訳ございませんが、まずOllamaモデルをダウンロードする必要があります。左下にダウンロードボタンがあります。お楽しみください！
ko: 죄송합니다. 먼저 Ollama 모델을 다운로드해야 합니다. 왼쪽 하단에 다운로드 버튼이 있습니다. 즐거운 시간 보내세요!
zh_hans: 抱歉，您需要先下载一个 Ollama 模型。您可以在左下角找到下载按钮。祝您使用愉快！

# welcome.description
source: OllamaSpring is a comprehensive Mac client for managing the various models offered by the ollama community, and for creating conversational AI experiences.
ar: OllamaSpring هو عميل Mac شامل لإدارة النماذج المختلفة التي تقدمها مجتمع ollama وإنشاء تجارب الذكاء الاصطناعي المحادثة.
de: OllamaSpring ist ein umfassender Mac-Client zur Verwaltung der verschiedenen Modelle der Ollama-Community und zur Erstellung von konversationellen KI-Erlebnissen.
es: OllamaSpring es un cliente Mac completo para gestionar los diversos modelos ofrecidos por la comunidad ollama y crear experiencias de IA conversacional.
fr: OllamaSpring est un client Mac complet pour gérer les différents modèles proposés par la communauté ollama et créer des expériences d'IA conversationnelle.
ja: OllamaSpringは、ollamaコミュニティが提供する様々なモデルを管理し、会話型AI体験を作成するための包括的なMacクライアントです。
ko: OllamaSpring은 ollama 커뮤니티가 제공하는 다양한 모델을 관리하고 대화형 AI 경험을 만들기 위한 포괄적인 Mac 클라이언트입니다.
zh_hans: OllamaSpring 是一个全面的 Mac 客户端，用于管理 ollama 社区提供的各种模型，并创建对话式 AI 体验。

# sendmsg.revoke
source: Revoke
ar: إلغاء
de: Widerrufen
es: Revocar
fr: Révoquer
ja: 取り消し
ko: 취소
zh_hans: 撤销

# sendmsg.voice_not_available
source: Voice-to-text is not available currently
ar: تحويل الصوت إلى نص غير متاح حالياً
de: Sprach-zu-Text ist derzeit nicht verfügbar
es: La conversión de voz a texto no está disponible actualmente
fr: La conversion voix-texte n'est pas disponible actuellement
ja: 音声からテキストへの変換は現在利用できません
ko: 음성-텍스트 변환은 현재 사용할 수 없습니다
zh_hans: 语音转文字功能暂未开放

# sendmsg.deepseek_upload_coming
source: File upload for DeepSeek is coming soon
ar: رفع الملفات لـ DeepSeek قريباً
de: Datei-Upload für DeepSeek kommt bald
es: La carga de archivos para DeepSeek llegará pronto
fr: Le téléchargement de fichiers pour DeepSeek arrive bientôt
ja: DeepSeekのファイルアップロード機能は近日公開予定です
ko: DeepSeek 파일 업로드 기능이 곧 출시됩니다
zh_hans: DeepSeek 文件上传功能即将推出

# sendmsg.select_model_first
source: You need select a model on top bar first or download a model first
ar: تحتاج أولاً إلى اختيار نموذج في الشريط العلوي أو تحميل نموذج
de: Sie müssen zuerst ein Modell in der oberen Leiste auswählen oder ein Modell herunterladen
es: Primero necesitas seleccionar un modelo en la barra superior o descargar un modelo
fr: Vous devez d'abord sélectionner un modèle dans la barre supérieure ou télécharger un modèle
ja: まず上部バーでモデルを選択するか、モデルをダウンロードしてください
ko: 먼저 상단 바에서 모델을 선택하거나 모델을 다운로드해야 합니다
zh_hans: 请先在顶部选择模型或下载模型

# sendmsg.create_conversation_first
source: You need create a new conversation on left top bar first.
ar: تحتاج أولاً إلى إنشاء محادثة جديدة في الشريط العلوي الأيسر.
de: Sie müssen zuerst ein neues Gespräch in der oberen linken Leiste erstellen.
es: Primero necesitas crear una nueva conversación en la barra superior izquierda.
fr: Vous devez d'abord créer une nouvelle conversation dans la barre supérieure gauche.
ja: まず左上バーで新しい会話を作成してください。
ko: 먼저 왼쪽 상단 바에서 새 대화를 만들어야 합니다.
zh_hans: 请先在左上角创建新对话

# main.welcome
source: Welcome To OllamaSpring
ar: مرحباً بك في OllamaSpring
de: Willkommen bei OllamaSpring
es: Bienvenido a OllamaSpring
fr: Bienvenue dans OllamaSpring
ja: OllamaSpringへようこそ
ko: OllamaSpring에 오신 것을 환영합니다
zh_hans: 欢迎使用 OllamaSpring

# main.start_without_ollama
source: Start Without Ollama
ar: بدء بدون Ollama
de: Ohne Ollama starten
es: Iniciar sin Ollama
fr: Démarrer sans Ollama
ja: Ollamaなしで開始
ko: Ollama 없이 시작
zh_hans: 不使用 Ollama 启动

# main.ollama_not_available
source: Ollama API service is not available on your Mac. If you want to run Ollama models locally on your Mac, follow these steps to install and set up Ollama first. If you host Ollama api service on specific host, you should just enter your own Ollama host below.
ar: خدمة API Ollama غير متاحة على جهاز Mac الخاص بك. إذا كنت تريد تشغيل نماذج Ollama محلياً على جهاز Mac الخاص بك، اتبع هذه الخطوات لتثبيت وإعداد Ollama أولاً. إذا كنت تستضيف خدمة API Ollama على خادم محدد، ما عليك سوى إدخال خادم Ollama الخاص بك أدناه.
de: Ollama API-Service ist auf Ihrem Mac nicht verfügbar. Wenn Sie Ollama-Modelle lokal auf Ihrem Mac ausführen möchten, folgen Sie diesen Schritten, um Ollama zu installieren und einzurichten. Wenn Sie Ollama API-Service auf einem bestimmten Host hosten, geben Sie einfach Ihren eigenen Ollama-Host unten ein.
es: El servicio API de Ollama no está disponible en tu Mac. Si quieres ejecutar modelos de Ollama localmente en tu Mac, sigue estos pasos para instalar y configurar Ollama primero. Si alojas el servicio API de Ollama en un host específico, simplemente ingresa tu propio host de Ollama abajo.
fr: Le service API Ollama n'est pas disponible sur votre Mac. Si vous souhaitez exécuter des modèles Ollama localement sur votre Mac, suivez ces étapes pour installer et configurer Ollama en premier. Si vous hébergez le service API Ollama sur un hôte spécifique, vous devez simplement entrer votre propre hôte Ollama ci-dessous.
ja: お使いのMacでOllama APIサービスが利用できません。MacでOllamaモデルをローカルで実行したい場合は、まずOllamaをインストールして設定する手順に従ってください。特定のホストでOllama APIサービスをホストしている場合は、下に独自のOllamaホストを入力してください。
ko: Mac에서 Ollama API 서비스를 사용할 수 없습니다. Mac에서 Ollama 모델을 로컬로 실행하려면 먼저 Ollama를 설치하고 설정하는 다음 단계를 따르세요. 특정 호스트에서 Ollama API 서비스를 호스팅하는 경우 아래에 자체 Ollama 호스트를 입력하세요.
zh_hans: 您的 Mac 上没有可用的 Ollama API 服务。如果您想在本地运行 Ollama 模型，请按照以下步骤安装和设置 Ollama。如果您在特定主机上托管 Ollama API 服务，您可以在下方输入您自己的 Ollama 主机地址。

# main.step1_install
source: Step 1: Install Ollama
ar: الخطوة 1: تثبيت Ollama
de: Schritt 1: Ollama installieren
es: Paso 1: Instalar Ollama
fr: Étape 1 : Installer Ollama
ja: ステップ1：Ollamaをインストール
ko: 1단계: Ollama 설치
zh_hans: 步骤 1：安装 Ollama

# main.step2_refresh
source: Step 2: Refresh
ar: الخطوة 2: تحديث
de: Schritt 2: Aktualisieren
es: Paso 2: Actualizar
fr: Étape 2 : Actualiser
ja: ステップ2：更新
ko: 2단계: 새로 고침
zh_hans: 步骤 2：刷新

# main.enter_ollama_host
source: Enter your own Ollama host
ar: أدخل خادم Ollama الخاص بك
de: Geben Sie Ihren eigenen Ollama-Host ein
es: Ingresa tu propio host de Ollama
fr: Entrez votre propre hôte Ollama
ja: 独自のOllamaホストを入力
ko: 자체 Ollama 호스트 입력
zh_hans: 输入您的 Ollama 主机地址

# messages.assistant
source: Assistant
ar: المساعد
de: Assistent
es: Asistente
ja: アシスタント
ko: 어시스턴트
zh_hans: 助手

# messages.text
source: Text
ar: نص
es: Texto
fr: Texte
ja: テキスト
ko: 텍스트
zh_hans: 文本

# messages.waiting
source: waiting ...
ar: في الانتظار...
de: Warten...
es: Esperando...
fr: En attente...
ja: 待機中...
ko: 대기 중...
zh_hans: 等待中...

# chatlist.conversation
source: Conversation
ar: محادثة
de: Gespräch
es: Conversación
ja: 会話
ko: 대화
zh_hans: 对话

# chatlist.model
source: Model
ar: النموذج
de: Modell
es: Modelo
fr: Modèle
ja: モデル
ko: 모델
zh_hans: 模型

# chatlist.download_first
source: You should download a model first and select a preffered one before creating a new chat
ar: يجب عليك أولاً تحميل نموذج واختيار نموذج مفضل قبل إنشاء محادثة جديدة
de: Sie sollten zuerst ein Modell herunterladen und ein bevorzugtes auswählen, bevor Sie einen neuen Chat erstellen
es: Primero debes descargar un modelo y seleccionar uno preferido antes de crear un nuevo chat
fr: Vous devez d'abord télécharger un modèle et sélectionner un modèle préféré avant de créer un nouveau chat
ja: 新しいチャットを作成する前に、まずモデルをダウンロードして好みのモデルを選択してください
ko: 새 채팅을 만들기 전에 먼저 모델을 다운로드하고 선호하는 모델을 선택해야 합니다
zh_hans: 请先下载一个模型并选择您喜欢的模型，然后再创建新对话

# chatlist.remove
source: Remove
ar: إزالة
de: Entfernen
es: Eliminar
fr: Supprimer
ja: 削除
ko: 제거
zh_hans: 删除

# chatlist.downloads
source: Local Models
ar: التحميلات
de: Lokale Modelle
es: Modelos locales
fr: Téléchargements
ja: ローカルモデル
ko: 로컬 모델
zh_hans: 本地模型

# chatlist.no_model_installed
source: No models installed
de: Keine Modelle installiert
es: No hay modelos instalados
ja: モデルがインストールされていません
ko: 설치된 모델이 없습니다
zh_hans: 未安装任何模型

# chatlist.reset_all
source: Reset All
ar: إعادة تعيين الكل
de: Alles zurücksetzen
es: Restablecer todo
fr: Tout réinitialiser
ja: すべてリセット
ko: 모두 재설정
zh_hans: 重置全部

# chatlist.temperature
source: Temperature
ar: درجة الحرارة
de: Temperatur
es: Temperatura
fr: Température
ja: 温度
ko: 온도
zh_hans: 温度

# chatlist.temperature_desc
source: The temperature of the model. Increasing the temperature will make the model answer more creatively. (Default: 0.8)
ar: درجة حرارة النموذج. زيادة درجة الحرارة ستجعل إجابات النموذج أكثر إبداعاً. (افتراضي: 0.8)
de: Die Temperatur des Modells. Eine Erhöhung der Temperatur macht die Antworten des Modells kreativer. (Standard: 0.8)
es: La temperatura del modelo. Aumentar la temperatura hará que las respuestas del modelo sean más creativas. (Predeterminado: 0.8)
fr: La température du modèle. Augmenter la température rendra les réponses du modèle plus créatives. (Par défaut : 0.8)
ja: モデルの温度。温度を上げると、モデルの回答がより創造的になります。（デフォルト：0.8）
ko: 모델의 온도. 온도를 높이면 모델의 답변이 더 창의적이 됩니다. (기본값: 0.8)
zh_hans: 模型的温度参数。增加温度会使模型的回答更具创造性。（默认值：0.8）

# chatlist.seed
source: Seed
ar: البذرة
es: Semilla
fr: Graine
ja: シード
ko: 시드
zh_hans: 种子

# chatlist.seed_desc
source: Sets the random number seed to use for generation. Setting this to a specific number will make the model generate the same text for the same prompt. (Default: 0)
ar: يحدد بذرة الأرقام العشوائية المستخدمة في التوليد. تعيين هذا إلى رقم محدد سيجعل النموذج يولد نفس النص لنفس الـ prompt. (افتراضي: 0)
de: Setzt den Zufallszahlen-Seed für die Generierung. Das Setzen auf eine bestimmte Zahl bewirkt, dass das Modell für denselben Prompt denselben Text generiert. (Standard: 0)
es: Establece la semilla de números aleatorios para usar en la generación. Establecer esto en un número específico hará que el modelo genere el mismo texto para el mismo prompt. (Predeterminado: 0)
fr: Définit la graine de nombres aléatoires à utiliser pour la génération. Définir ceci à un nombre spécifique fera que le modèle générera le même texte pour le même prompt. (Par défaut : 0)
ja: 生成に使用する乱数シードを設定します。特定の数値に設定すると、同じプロンプトに対してモデルが同じテキストを生成します。（デフォルト：0）
ko: 생성에 사용할 난수 시드를 설정합니다. 특정 숫자로 설정하면 모델이 같은 프롬프트에 대해 같은 텍스트를 생성합니다. (기본값: 0)
zh_hans: 设置用于生成的随机数种子。设置为特定数字将使模型对相同的提示生成相同的文本。（默认值：0）

# chatlist.context_tokens
source: Context Tokens
ar: رموز السياق
de: Kontext-Tokens
es: Tokens de contexto
fr: Jetons de contexte
ja: コンテキストトークン
ko: 컨텍스트 토큰
zh_hans: 上下文长度

# chatlist.context_tokens_desc
source: Sets the size of the context window used to generate the next token. (Default: 2048)
ar: يحدد حجم نافذة السياق المستخدمة لتوليد الرمز التالي. (افتراضي: 2048)
de: Setzt die Größe des Kontextfensters, das zur Generierung des nächsten Tokens verwendet wird. (Standard: 2048)
es: Establece el tamaño de la ventana de contexto utilizada para generar el siguiente token. (Predeterminado: 2048)
fr: Définit la taille de la fenêtre de contexte utilisée pour générer le jeton suivant. (Par défaut : 2048)
ja: 次のトークンを生成するために使用されるコンテキストウィンドウのサイズを設定します。（デフォルト：2048）
ko: 다음 토큰을 생성하는 데 사용되는 컨텍스트 창의 크기를 설정합니다. (기본값: 2048)
zh_hans: 设置用于生成下一个标记的上下文窗口大小。（默认值：2048）

# chatlist.top_k_desc
source: Reduces the probability of generating nonsense. A higher value (e.g. 100) will give more diverse answers, while a lower value (e.g. 10) will be more conservative. (Default: 40)
ar: يقلل من احتمالية توليد الهراء. القيمة الأعلى (مثل 100) ستعطي إجابات أكثر تنوعاً، بينما القيمة الأقل (مثل 10) ستكون أكثر تحفظاً. (افتراضي: 40)
de: Reduziert die Wahrscheinlichkeit, Unsinn zu generieren. Ein höherer Wert (z.B. 100) gibt vielfältigere Antworten, während ein niedrigerer Wert (z.B. 10) konservativer ist. (Standard: 40)
es: Reduce la probabilidad de generar sin sentido. Un valor más alto (por ejemplo 100) dará respuestas más diversas, mientras que un valor más bajo (por ejemplo 10) será más conservador. (Predeterminado: 40)
fr: Réduit la probabilité de générer du non-sens. Une valeur plus élevée (par exemple 100) donnera des réponses plus diverses, tandis qu'une valeur plus faible (par exemple 10) sera plus conservatrice. (Par défaut : 40)
ja: 無意味な内容の生成確率を減らします。高い値（例：100）はより多様な回答を与え、低い値（例：10）はより保守的になります。（デフォルト：40）
ko: 무의미한 내용 생성 확률을 줄입니다. 높은 값(예: 100)은 더 다양한 답변을 제공하고, 낮은 값(예: 10)은 더 보수적입니다. (기본값: 40)
zh_hans: 减少生成无意义内容的概率。较高的值（如100）会产生更多样化的答案，而较低的值（如10）会更保守。（默认值：40）

# chatlist.top_p_desc
source: Works together with top-k. A higher value (e.g., 0.95) will lead to more diverse text, while a lower value (e.g., 0.5) will generate more focused and conservative text. (Default: 0.9)
ar: يعمل مع top-k. القيمة الأعلى (مثل 0.95) ستؤدي إلى نص أكثر تنوعاً، بينما القيمة الأقل (مثل 0.5) ستولد نصاً أكثر تركيزاً وتحفظاً. (افتراضي: 0.9)
de: Funktioniert zusammen mit top-k. Ein höherer Wert (z.B. 0.95) führt zu vielfältigerem Text, während ein niedrigerer Wert (z.B. 0.5) fokussierteren und konservativeren Text generiert. (Standard: 0.9)
es: Funciona junto con top-k. Un valor más alto (por ejemplo 0.95) llevará a texto más diverso, mientras que un valor más bajo (por ejemplo 0.5) generará texto más enfocado y conservador. (Predeterminado: 0.9)
fr: Fonctionne avec top-k. Une valeur plus élevée (par exemple 0.95) mènera à un texte plus diversifié, tandis qu'une valeur plus faible (par exemple 0.5) générera un texte plus focalisé et conservateur. (Par défaut : 0.9)
ja: top-kと連携して動作します。高い値（例：0.95）はより多様なテキストを生成し、低い値（例：0.5）はより焦点を絞った保守的なテキストを生成します。（デフォルト：0.9）
ko: top-k와 함께 작동합니다. 높은 값(예: 0.95)은 더 다양한 텍스트를 생성하고, 낮은 값(예: 0.5)은 더 집중되고 보수적인 텍스트를 생성합니다. (기본값: 0.9)
zh_hans: 与 top-k 配合使用。较高的值（如0.95）会产生更多样化的文本，而较低的值（如0.5）会生成更集中和保守的文本。（默认值：0.9）

# chatlist.delete_success
source: The model have been deleted successfully. You may want to restat OllamaSpring.
ar: تم حذف النموذج بنجاح. قد تحتاج إلى إعادة تشغيل OllamaSpring.
de: Das Modell wurde erfolgreich gelöscht. Sie sollten OllamaSpring neu starten.
es: El modelo ha sido eliminado exitosamente. Es posible que necesites reiniciar OllamaSpring.
fr: Le modèle a été supprimé avec succès. Vous devrez peut-être redémarrer OllamaSpring.
ja: モデルが正常に削除されました。OllamaSpringを再起動する必要があるかもしれません。
ko: 모델이 성공적으로 삭제되었습니다. OllamaSpring을 재시작해야 할 수도 있습니다.
zh_hans: 模型已成功删除。您可能需要重启 OllamaSpring。

# chatlist.close
source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
zh_hans: 关闭

# chatlist.restart_now
source: Restart Now
ar: إعادة التشغيل الآن
de: Jetzt neu starten
es: Reiniciar ahora
fr: Redémarrer maintenant
ja: 今すぐ再起動
ko: 지금 재시작
zh_hans: 立即重启

# chatlist.download_process
source: Download Process
ar: عملية التحميل
de: Download-Fortschritt
es: Proceso de descarga
fr: Processus de téléchargement
ja: ダウンロード進行状況
ko: 다운로드 진행 상황
zh_hans: 下载进度

# chatlist.warning
source: Warning
ar: تحذير
de: Warnung
es: Advertencia
fr: Avertissement
ja: 警告
ko: 경고
zh_hans: 警告

# chatlist.delete_confirm
source: Are you sure to delete %@?
ar: هل أنت متأكد من أنك تريد حذف %@؟
de: Sind Sie sicher, dass Sie %@ löschen möchten?
es: ¿Estás seguro de que quieres eliminar %@?
fr: Êtes-vous sûr de vouloir supprimer %@ ?
ja: %@を削除してもよろしいですか？
ko: %@을(를) 삭제하시겠습니까?
zh_hans: 确定要删除 %@ 吗？

# chatlist.download_confirm_title
source: Download: %@
ar: تحميل: %@
es: Descarga: %@
fr: Téléchargement : %@
ja: ダウンロード：%@
ko: 다운로드: %@
zh_hans: 下载：%@

# chatlist.download_confirm_content
source: This will take a few minutes, continue?
ar: سيستغرق هذا بضع دقائق، هل تريد المتابعة؟
de: Dies wird einige Minuten dauern, fortfahren?
es: Esto tomará unos minutos, ¿continuar?
fr: Cela prendra quelques minutes, continuer ?
ja: これには数分かかります。続行しますか？
ko: 몇 분 정도 소요됩니다. 계속하시겠습니까?
zh_hans: 这可能需要几分钟时间，是否继续？

# chatlist.model_not_exist
source: The model does not exist. You may want to restart OllamaSpring.
ar: النموذج غير موجود. قد تحتاج إلى إعادة تشغيل OllamaSpring.
de: Das Modell existiert nicht. Sie sollten OllamaSpring neu starten.
es: El modelo no existe. Es posible que necesites reiniciar OllamaSpring.
fr: Le modèle n'existe pas. Vous devrez peut-être redémarrer OllamaSpring.
ja: モデルが存在しません。OllamaSpringを再起動する必要があるかもしれません。
ko: 모델이 존재하지 않습니다. OllamaSpring을 재시작해야 할 수도 있습니다.
zh_hans: 模型不存在。您可能需要重启 OllamaSpring。

# chatlist.later
source: Later
ar: لاحقاً
de: Später
es: Más tarde
fr: Plus tard
ja: 後で
ko: 나중에
zh_hans: 稍后

# chatlist.installed
source: Installed
ar: مثبت
de: Installiert
es: Instalado
fr: Installé
ja: インストール済み
ko: 설치됨
zh_hans: 已安装

# chatlist.download
source: Download
ar: تحميل
es: Descargar
fr: Télécharger
ja: ダウンロード
ko: 다운로드
zh_hans: 下载

# proxy.enable
source: Enable Http Proxy
ar: تفعيل الوكيل HTTP
de: HTTP-Proxy aktivieren
es: Habilitar proxy HTTP
fr: Activer le proxy HTTP
ja: HTTPプロキシを有効にする
ko: HTTP 프록시 활성화
zh_hans: 启用 HTTP 代理

# proxy.disable
source: Disable Http Proxy
ar: إلغاء تفعيل الوكيل HTTP
de: HTTP-Proxy deaktivieren
es: Deshabilitar proxy HTTP
fr: Désactiver le proxy HTTP
ja: HTTPプロキシを無効にする
ko: HTTP 프록시 비활성화
zh_hans: 禁用 HTTP 代理

# proxy.host_name
source: Host Name
ar: اسم المضيف
es: Nombre del host
fr: Nom d'hôte
ja: ホスト名
ko: 호스트 이름
zh_hans: 主机名

# proxy.port_number
source: Port Number
ar: رقم المنفذ
de: Port-Nummer
es: Número de puerto
fr: Numéro de port
ja: ポート番号
ko: 포트 번호
zh_hans: 端口号

# proxy.enable_auth
source: Enable Proxy Auth
ar: تفعيل مصادقة الوكيل
de: Proxy-Authentifizierung aktivieren
es: Habilitar autenticación de proxy
fr: Activer l'authentification proxy
ja: プロキシ認証を有効にする
ko: 프록시 인증 활성화
zh_hans: 启用代理认证

# proxy.disable_auth
source: Disable Proxy Auth
ar: إلغاء تفعيل مصادقة الوكيل
de: Proxy-Authentifizierung deaktivieren
es: Deshabilitar autenticación de proxy
fr: Désactiver l'authentification proxy
ja: プロキシ認証を無効にする
ko: 프록시 인증 비활성화
zh_hans: 禁用代理认证

# proxy.login
source: Login
ar: تسجيل الدخول
de: Anmeldung
es: Inicio de sesión
fr: Connexion
ja: ログイン
ko: 로그인
zh_hans: 登录名

# proxy.password
source: Password
ar: كلمة المرور
de: Passwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 비밀번호
zh_hans: 密码

# proxy.save
source: Save
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
zh_hans: 保存

# proxy.cancel
source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
zh_hans: 取消

# modal.cancel
source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
zh_hans: 取消

# modal.confirm
source: Confirm
ar: تأكيد
de: Bestätigen
es: Confirmar
fr: Confirmer
ja: 確認
ko: 확인
zh_hans: 确认

# deepseek.enter_secret_key
source: ENTER SECRET KEY
ar: أدخل المفتاح السري
de: GEHEIMEN SCHLÜSSEL EINGEBEN
es: INGRESAR CLAVE SECRETA
fr: ENTRER LA CLÉ SECRÈTE
ja: シークレットキーを入力
ko: 시크릿 키 입력
zh_hans: 输入密钥

# deepseek.how_to_apply
source: How to apply a DeepSeek API key?
ar: كيفية التقدم بطلب للحصول على مفتاح API DeepSeek؟
de: Wie beantrage ich einen DeepSeek API-Schlüssel?
es: ¿Cómo solicitar una clave API de DeepSeek?
fr: Comment demander une clé API DeepSeek ?
ja: DeepSeek APIキーを申請する方法は？
ko: DeepSeek API 키를 신청하는 방법은?
zh_hans: 如何申请 DeepSeek API 密钥？

# deepseek.click_here
source: click here
ar: انقر هنا
de: hier klicken
es: haz clic aquí
fr: cliquez ici
ja: ここをクリック
ko: 여기를 클릭
zh_hans: 点击这里

# deepseek.connection_failed
source: Connection Failed
ar: فشل الاتصال
de: Verbindung fehlgeschlagen
es: Error de conexión
fr: Échec de la connexion
ja: 接続に失敗しました
ko: 연결 실패
zh_hans: 连接失败

# deepseek.connection_failed_desc
source: Failed to connect to DeepSeek host. Please verify your apiKey or HTTP Proxy Config.
ar: فشل الاتصال بخادم DeepSeek. يرجى التحقق من مفتاح API أو إعدادات الوكيل HTTP.
de: Verbindung zum DeepSeek-Host fehlgeschlagen. Bitte überprüfen Sie Ihren API-Schlüssel oder die HTTP-Proxy-Konfiguration.
es: No se pudo conectar al host de DeepSeek. Por favor verifica tu clave API o la configuración del proxy HTTP.
fr: Impossible de se connecter à l'hôte DeepSeek. Veuillez vérifier votre clé API ou la configuration du proxy HTTP.
ja: DeepSeekホストへの接続に失敗しました。APIキーまたはHTTPプロキシ設定を確認してください。
ko: DeepSeek 호스트에 연결할 수 없습니다. API 키 또는 HTTP 프록시 설정을 확인하세요.
zh_hans: 无法连接到 DeepSeek 服务器。请验证您的 API 密钥或 HTTP 代理配置。

# deepseek.ok
source: OK
ar: موافق
ko: 확인
zh_hans: 确定

# deepseek.description
source: DeepSeek achieves a significant breakthrough in inference speed over previous models. It tops the leaderboard among open-source models and rivals the most advanced closed-source models globally.
ar: يحقق DeepSeek اختراقاً كبيراً في سرعة الاستدلال مقارنة بالنماذج السابقة. يتصدر قائمة التصنيف بين النماذج مفتوحة المصدر ويتنافس مع أكثر النماذج المغلقة المصدر تقدماً في العالم.
de: DeepSeek erzielt einen bedeutenden Durchbruch in der Inferenzgeschwindigkeit gegenüber früheren Modellen. Es führt die Rangliste unter Open-Source-Modellen an und konkurriert mit den fortschrittlichsten Closed-Source-Modellen weltweit.
es: DeepSeek logra un avance significativo en la velocidad de inferencia sobre modelos anteriores. Encabeza la tabla de clasificación entre modelos de código abierto y compite con los modelos de código cerrado más avanzados del mundo.
fr: DeepSeek réalise une percée significative dans la vitesse d'inférence par rapport aux modèles précédents. Il se classe en tête du classement parmi les modèles open-source et rivalise avec les modèles closed-source les plus avancés au monde.
ja: DeepSeekは、以前のモデルと比較して推論速度において重要なブレークスルーを達成しました。オープンソースモデルの中でリーダーボードのトップに立ち、世界で最も先進的なクローズドソースモデルと競合しています。
ko: DeepSeek는 이전 모델 대비 추론 속도에서 중요한 돌파구를 달성했습니다. 오픈소스 모델 중 리더보드 1위를 차지하며 전 세계에서 가장 진보된 클로즈드소스 모델과 경쟁합니다.
zh_hans: DeepSeek 在推理速度方面取得了重大突破。它在开源模型中位居榜首，并与全球最先进的闭源模型相媲美。

# groq.api_title
source: Groq Fast API
ar: API Groq السريع
es: API Groq Fast
fr: API Groq Fast
zh_hans: Groq 快速 API

# groq.enter_secret_key
source: ENTER SECRET KEY
ar: أدخل المفتاح السري
de: GEHEIMEN SCHLÜSSEL EINGEBEN
es: INGRESAR CLAVE SECRETA
fr: ENTRER LA CLÉ SECRÈTE
ja: シークレットキーを入力
ko: 시크릿 키 입력
zh_hans: 输入密钥

# groq.how_to_apply
source: How to apply a Groq API key?
ar: كيفية التقدم بطلب للحصول على مفتاح API Groq؟
de: Wie beantrage ich einen Groq API-Schlüssel?
es: ¿Cómo solicitar una clave API de Groq?
fr: Comment demander une clé API Groq ?
ja: Groq APIキーを申請する方法は？
ko: Groq API 키를 신청하는 방법은?
zh_hans: 如何申请 Groq API 密钥？

# groq.click_here
source: click here
ar: انقر هنا
de: hier klicken
es: haz clic aquí
fr: cliquez ici
ja: ここをクリック
ko: 여기를 클릭
zh_hans: 点击这里

# groq.connection_failed
source: Connection Failed
de: Verbindung fehlgeschlagen
es: Error de conexión
ja: 接続に失敗しました
ko: 연결 실패
zh_hans: 连接失败

# groq.connection_failed_desc
source: Failed to connect to Groq host. Please verify your apiKey or HTTP Proxy Config.
de: Verbindung zum Groq-Host fehlgeschlagen. Bitte überprüfen Sie Ihren apiKey oder die HTTP-Proxy-Konfiguration.
es: No se pudo conectar al host de Groq. Por favor verifica tu apiKey o la configuración del proxy HTTP.
ja: Groqホストへの接続に失敗しました。apiKeyまたはHTTPプロキシ設定を確認してください。
ko: Groq 호스트에 연결할 수 없습니다. apiKey 또는 HTTP 프록시 구성을 확인하세요.
zh_hans: 无法连接到 Groq 主机。请验证您的 apiKey 或 HTTP 代理配置。

# groq.ok
source: OK
ko: 확인
zh_hans: 确定
